test/integration/helpers/fixtures/invoice-search.json

[
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/recipients",
        "body": {
            "type": "individual",
            "firstName": "Tom",
            "lastName": "Jones",
            "email": "testEmail@example.com",
            "address": {
                "street1": "123 Wolfstrasse",
                "city": "Berlin",
                "country": "DE",
                "postalCode": "123123"
            }
        },
        "status": 200,
        "response": {
            "ok": true,
            "recipient": {
                "id": "R-92tpE4A1Rdg1awMLFhYtNu",
                "referenceId": "R-92tpE4A1Rdg1awMLFhYtNu",
                "email": "testEmail@example.com",
                "name": "Tom Jones",
                "lastName": "Jones",
                "firstName": "Tom",
                "legalName": "",
                "type": "individual",
                "status": "incomplete",
                "language": "en",
                "complianceStatus": "pending",
                "dob": null,
                "passport": "",
                "placeOfBirth": null,
                "updatedAt": "2022-10-23T03:01:02.669Z",
                "createdAt": "2022-10-23T03:01:02.669Z",
                "tags": [],
                "isPortalUser": false,
                "taxDeliveryType": "mail",
                "contactEmails": [],
                "occupation": "",
                "address": {
                    "street1": "123 Wolfstrasse",
                    "street2": "",
                    "city": "Berlin",
                    "postalCode": "123123",
                    "country": "DE",
                    "region": null,
                    "phone": "",
                    "phoneValidated": false
                },
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                "governmentId": null,
                "ssn": null,
                "governmentIds": [],
                "birthplace": {
                    "country": null,
                    "region": null,
                    "city": null
                },
                "citizenships": [],
                "routeType": "sepa",
                "routeMinimum": "0",
                "estimatedFees": "4",
                "accounts": [],
                "payoutMethod": null,
                "primaryCurrency": null,
                "riskScore": null,
                "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                "inactiveReasons": {
                    "primaryAccount": "missing"
                },
                "taxWithholdingPercentage": null,
                "taxForm": null,
                "taxFormStatus": null
            }
        },
        "rawHeaders": [
            "Date",
            "Sun, 23 Oct 2022 03:01:02 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1595",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "74",
            "X-Rate-Limit-Reset",
            "1666494122",
            "Vary",
            "Origin",
            "ETag",
            "W/\"63b-HSupU3gXUgBkaA29N1K7vu6dSJM\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/invoices/create",
        "body": {
            "recipientId": "R-92tpE4A1Rdg1awMLFhYtNu",
            "description": "Test Invoice",
            "externalId": "testInvoice",
            "invoiceDate": "2020-01-01",
            "dueDate": "2020-01-01"
        },
        "status": 200,
        "response": {
            "ok": true,
            "invoice": {
                "id": "I-KWYntbnGcVip5rFp9CkcDh",
                "invoiceNumber": "",
                "description": "Test Invoice",
                "status": "open",
                "externalId": "testInvoice",
                "invoiceDate": "2020-01-01T00:00:00.000Z",
                "dueDate": "2020-01-01T00:00:00.000Z",
                "releaseAfter": null,
                "createdAt": "2022-10-23T03:01:03.041Z",
                "updatedAt": "2022-10-23T03:01:03.041Z",
                "totalAmount": {
                    "value": "0.00",
                    "currency": "USD"
                },
                "paidAmount": {
                    "value": "0.00",
                    "currency": "USD"
                },
                "dueAmount": {
                    "value": "0.00",
                    "currency": "USD"
                },
                "tags": [],
                "lines": [],
                "recipientId": "R-92tpE4A1Rdg1awMLFhYtNu"
            }
        },
        "rawHeaders": [
            "Date",
            "Sun, 23 Oct 2022 03:01:03 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "696",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "73",
            "X-Rate-Limit-Reset",
            "1666494122",
            "Vary",
            "Origin",
            "ETag",
            "W/\"2b8-Z2JiZV4UaJcZPqgT/wYZkYMob/k\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/invoices/create",
        "body": {
            "recipientId": "R-92tpE4A1Rdg1awMLFhYtNu",
            "description": "Test Invoice",
            "externalId": "otherInvoice",
            "invoiceDate": "2020-01-01",
            "dueDate": "2020-01-01"
        },
        "status": 200,
        "response": {
            "ok": true,
            "invoice": {
                "id": "I-T3uEp66RDyQXKLsQ216qdm",
                "invoiceNumber": "",
                "description": "Test Invoice",
                "status": "open",
                "externalId": "otherInvoice",
                "invoiceDate": "2020-01-01T00:00:00.000Z",
                "dueDate": "2020-01-01T00:00:00.000Z",
                "releaseAfter": null,
                "createdAt": "2022-10-23T03:01:03.422Z",
                "updatedAt": "2022-10-23T03:01:03.422Z",
                "totalAmount": {
                    "value": "0.00",
                    "currency": "USD"
                },
                "paidAmount": {
                    "value": "0.00",
                    "currency": "USD"
                },
                "dueAmount": {
                    "value": "0.00",
                    "currency": "USD"
                },
                "tags": [],
                "lines": [],
                "recipientId": "R-92tpE4A1Rdg1awMLFhYtNu"
            }
        },
        "rawHeaders": [
            "Date",
            "Sun, 23 Oct 2022 03:01:03 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "697",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "72",
            "X-Rate-Limit-Reset",
            "1666494122",
            "Vary",
            "Origin",
            "ETag",
            "W/\"2b9-ksGZsmAp/io5gjS7YzIwxKMWXSM\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/invoices/search",
        "body": {
            "invoiceIds": [
                "I-KWYntbnGcVip5rFp9CkcDh",
                "I-T3uEp66RDyQXKLsQ216qdm"
            ]
        },
        "status": 200,
        "response": {
            "ok": true,
            "invoices": [
                {
                    "id": "I-T3uEp66RDyQXKLsQ216qdm",
                    "invoiceNumber": "",
                    "description": "Test Invoice",
                    "status": "open",
                    "externalId": "otherInvoice",
                    "invoiceDate": "2020-01-01T00:00:00.000Z",
                    "dueDate": "2020-01-01T00:00:00.000Z",
                    "releaseAfter": null,
                    "createdAt": "2022-10-23T03:01:03.422Z",
                    "updatedAt": "2022-10-23T03:01:03.422Z",
                    "totalAmount": {
                        "value": "0.00",
                        "currency": "USD"
                    },
                    "paidAmount": {
                        "value": "0.00",
                        "currency": "USD"
                    },
                    "dueAmount": {
                        "value": "0.00",
                        "currency": "USD"
                    },
                    "tags": [],
                    "lines": [],
                    "recipientId": "R-92tpE4A1Rdg1awMLFhYtNu"
                },
                {
                    "id": "I-KWYntbnGcVip5rFp9CkcDh",
                    "invoiceNumber": "",
                    "description": "Test Invoice",
                    "status": "open",
                    "externalId": "testInvoice",
                    "invoiceDate": "2020-01-01T00:00:00.000Z",
                    "dueDate": "2020-01-01T00:00:00.000Z",
                    "releaseAfter": null,
                    "createdAt": "2022-10-23T03:01:03.041Z",
                    "updatedAt": "2022-10-23T03:01:03.041Z",
                    "totalAmount": {
                        "value": "0.00",
                        "currency": "USD"
                    },
                    "paidAmount": {
                        "value": "0.00",
                        "currency": "USD"
                    },
                    "dueAmount": {
                        "value": "0.00",
                        "currency": "USD"
                    },
                    "tags": [],
                    "lines": [],
                    "recipientId": "R-92tpE4A1Rdg1awMLFhYtNu"
                }
            ],
            "meta": {
                "page": 1,
                "pages": 1,
                "records": 2
            }
        },
        "rawHeaders": [
            "Date",
            "Sun, 23 Oct 2022 03:01:03 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1548",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "71",
            "X-Rate-Limit-Reset",
            "1666494122",
            "Vary",
            "Origin",
            "ETag",
            "W/\"60c-IhjmXVrDe4manQe40zcVWNWFG6g\""
        ],
        "responseIsBinary": false
    }
]